import mysql.connector
from config import db_config

database_name = db_config['database']

def insert_question_data(text):
    conn = mysql.connector.MySQLConnection(**db_config)
    cur = conn.cursor()
    SQL_QUERY = "INSERT INTO QUESTION (Q_TEXT) VALUES (%s);"
    cur.execute(SQL_QUERY, (text,))
    conn.commit()
    ID=cur.lastrowid
    cur.close()
    conn.close()
    return ID
    
def insert_answer_data(text, qid, next_qid = None, is_final = False):
    conn = mysql.connector.MySQLConnection(**db_config)
    cur=conn.cursor()
    SQL_QUERY ="INSERT INTO ANSWER (OPTION_TEXT,QUESTION_ID,NEXT_QUESTION_ID,IS_FINAL) VALUES (%s,%s,%s,%s);"
    cur.execute(SQL_QUERY, (text,qid,next_qid,is_final))
    conn.commit()
    ID=cur.lastrowid
    cur.close()
    conn.close()
    return ID
    
def insert_result_data(text,ans_id):
    conn = mysql.connector.MySQLConnection(**db_config)
    cur=conn.cursor()
    SQL_QUERY = "INSERT INTO INSURANCE_RESULT (RES_TEXT,ANS_ID) VALUES (%s,%s);"
    cur.execute(SQL_QUERY, (text,ans_id))
    conn.commit()
    ID=cur.lastrowid
    cur.close()
    conn.close()
    return ID
        
def insert_user_data(cid,name,username,Time,score=0):
    conn = mysql.connector.MySQLConnection(**db_config)
    cur = conn.cursor()
    try:
        SQL_QUERY = "INSERT IGNORE INTO USERS (CHAT_ID,NAME, USERNAME,LAST_MSG_TIME,SCORE) VALUES (%s, %s, %s,%s,%s);"
        cur.execute(SQL_QUERY, (cid, name, username,Time,score))
        conn.commit()
    finally:
        cur.close()
        conn.close()
            
def update_user_data(cid,Time,score):
    conn = mysql.connector.MySQLConnection(**db_config)
    cur = conn.cursor()
    try:
        SQL_QUERY = "UPDATE USERS SET LAST_MSG_TIME=%s , SCORE=%s WHERE CHAT_ID=%s ;"
        cur.execute(SQL_QUERY, (Time,score,cid))
        conn.commit()
    finally:
            cur.close()
            conn.close()
            
def set_is_spam(cid,T=False)-> None:
    conn = mysql.connector.MySQLConnection(**db_config)
    cur = conn.cursor()
    try:
        SQL_QUERY = "UPDATE USERS SET IS_SPAM=%s,SCORE=%s WHERE CHAT_ID=%s;"
        cur.execute(SQL_QUERY, (T,0,cid))
        conn.commit()
    finally:
        cur.close()
        conn.close()

def insert_user_answers_data( cid, mid, qid, ans_id):
    conn = mysql.connector.MySQLConnection(**db_config)
    cur = conn.cursor()
    try:
        SQL_QUERY = "INSERT INTO USER_ANSWERS (CID, MID, QUESTION_ID, OPTION_ID) VALUES (%s, %s,%s, %s)"
        cur.execute(SQL_QUERY,(cid, mid, qid, ans_id))
        conn.commit()
    finally:
            cur.close()
            conn.close()

if __name__ == "__main__":
#questions
#بخش عمرانی
    insert_question_data(' نوع قرارداد ')#q1
    insert_question_data(' سطح قرارداد ')#q2
    insert_question_data('  نوع قرارداد اصلی')#q3
    insert_question_data('  نوع مجری در قرارداد اصلی')#q4
    insert_question_data('  محل اجرای قرارداد')#q5
    insert_question_data(' ملیت کارفرما')#q6
    insert_question_data('  ملیت مجری')#q7
    insert_question_data(' نوع مجری ')#q8
    insert_question_data(' نوع شخصیت مجری')#q9
    insert_question_data(' قرارداد بر اساس ضوابط تیپ سازمان برنامه و بودجه تنظیم گردیده')#q10
    insert_question_data(' تمام یا قسمتی از بودجه عملیات ازمحل طرح تملک داراییهای سرمایه ای (طرحهای عمرانی) دولت میباشد')#q11
    insert_question_data('تامین مصالح به عهده کدامیک از طرفین است ')#q12
    insert_question_data(' قرارداد براساس فهرست بها پایه سازمان برنامه و بودجه منعقد گردیده')#q13
    insert_question_data(' تمام یا قسمتی از بودجه عملیات ازمحل طرح تملک داراییهای سرمایه ای (طرحهای عمرانی) دولت میباشد')#q14
    insert_question_data(' نام کارفرما (واگذارنده‌كار)')#q15
    insert_question_data('موضوع قراراد')#q16
    insert_question_data('موضوع قراراد')#q17
    insert_question_data('موضوع قراراد')#q18
    insert_question_data('تامين اعتبار قرارداد از محل فروش اراضی آماده به متقاضیان و اشخاص است')#q19
    insert_question_data(' نام کارفرما (واگذارنده‌كار)')#20
    insert_question_data('موضوع قراراد')#q21
    insert_question_data('موضوع قراراد')#q22
    insert_question_data('موضوع قراراد')#q23
    insert_question_data('تامين اعتبار قرارداد از محل فروش اراضی آماده به متقاضیان و اشخاص است')#q24
#بخش غیرعمرانی
    insert_question_data('تعیین دسته بندی بر اساس نحوه اجرای عملیات')#25
    insert_question_data('محل اجراي عمليات')#q26
    insert_question_data('نوع شخصیت مجری')#q27
    insert_question_data('موضوع قرارداد')#28
    insert_question_data('موضوع قرارداد')#29
    insert_question_data('تعیین دسته بندی براساس فعالیت مجری ')#30
    insert_question_data('موضوع قرارداد')#31


    
    
    
#--------------------------------------------------------------------------------------    
#options
#بخش عمرانی
    insert_answer_data('غیرعمرانی ',1,25)#s1
    insert_answer_data('عمرانی ',1,2)#S2
    insert_answer_data('قرارداد فرعی است ',2,3)#s3
    insert_answer_data('قرارداد اصلی است ',2,5)#s4
    insert_answer_data('قرارداد اصلی غیرعمرانی ',3,None,True)#s5
    insert_answer_data('قرارداد اصلی عمرانی ',3,4)#s6
    insert_answer_data('مهندس مشاور ',4,None,True)#s7
    insert_answer_data('پیمانکار اجرایی ',4,None,True)#s8
    insert_answer_data('کلا خارج از کشور ',5,None,True)#s9
    insert_answer_data('تمام یا بخشی داخل کشور',5,6)#s10
    insert_answer_data('غیرایرانی ',6,None,True)#s11
    insert_answer_data('ایرانی ',6,7)#s12
    insert_answer_data('غیرایرانی ',7,None,True)#s13
    insert_answer_data('ایرانی ',7,8)#s14
    insert_answer_data('پیمانکار اجرایی ',8,12)#s15
    insert_answer_data('مهندس مشاور ',8,9)#s16
    insert_answer_data('حقیقی ',9,None,True)#s17
    insert_answer_data('حقوقی ',9,10)#s18
    insert_answer_data('خیر ',10,None,True)#s19
    insert_answer_data('بلی ',10,11)#s20
    insert_answer_data('خیر ',11,15)#s21
    insert_answer_data('بلی ',11,None,True)#s22
    insert_answer_data('تامین تمام مصالح توسط پیمانکار  ',12,13)#s23
    insert_answer_data('تامین تمام یا بخشی از مصالح توسط کارفرما ',12,None,True)#s24
    insert_answer_data('خیر ',13,None,True)#s25
    insert_answer_data('بلی ',13,14)#s26
    insert_answer_data('خیر ',14,20)#s27
    insert_answer_data('بلی ',14,None,True)#s28
    insert_answer_data('سازمان صنايع دفاع',15,None,True)#s29
    insert_answer_data('آستان قدس رضوی',15,16)#s3
    insert_answer_data('وزارت مسکن و شهرسازی ',15,17)#s31
    insert_answer_data('وزارت دفاع و پشتیبانی نیروهای مسلح',15,18)#s32
    insert_answer_data('سازمان تامین‌اجتماعی',15,18)#s33
    insert_answer_data('ساير ',15,None,True)#s34
    insert_answer_data('طرح توسعه حريم رضوی ',16,None,True)#s35
    insert_answer_data('سایر',16,None,True)#s36
    insert_answer_data('تسطیح و آماده سازی اراضي مي‌باشد',17,19)#s37
    insert_answer_data('سایر',17,None,True)#s38
    insert_answer_data('عملیات ساختماني',18,None,True)#s39
    insert_answer_data('سایر',18,None,True)#s40
    insert_answer_data('خیر',19,None,True)#s41
    insert_answer_data('بلی',19,None,True)#s42
    insert_answer_data('سازمان صنايع دفاع',20,None,True)#s43
    insert_answer_data('آستان قدس رضوی',20,21)#s44
    insert_answer_data('وزارت مسکن و شهرسازی ',20,22)#s45
    insert_answer_data('وزارت دفاع و پشتیبانی نیروهای مسلح',20,18)#s46
    insert_answer_data('سازمان تامین‌اجتماعی',20,23)#s47
    insert_answer_data('ساير ',20,None,True)#s48
    insert_answer_data('طرح توسعه حريم رضوی ',21,None,True)#s49
    insert_answer_data('سایر',21,None,True)#s50
    insert_answer_data('تسطیح و آماده سازی اراضي مي‌باشد',22,24)#s51
    insert_answer_data('سایر',22,None,True)#s52
    insert_answer_data('عملیات ساختماني',23,None,True)#s53
    insert_answer_data('سایر',23,None,True)#s54
    insert_answer_data('خیر',24,None,True)#s55
    insert_answer_data('بلی',24,None,True)#s56
#بخش غیرعمرانی

    insert_answer_data('به صورت متمرکز در محل کارگاه ثابت(مشمول ماده 47 قانون)',25,26)
    insert_answer_data('به صورت پراکنده و فاقد محل ثابت(مشمول ماده 41 قانون)',25)
    insert_answer_data('اجرای انفرادی ',25)
    insert_answer_data('کلا داخل کشور ',26,27)
    insert_answer_data('تمام یا بخشی خارج از كشور',26,31)
    insert_answer_data('حقیقی',27,28)
    insert_answer_data('حقوقی',27,29)
    insert_answer_data('ارائه خدمات مراقبت هاي اوليه بهداشتي و سلامت محور در پايگاههاي سلامت ',28)
    insert_answer_data(' تحقيقاتي وپژوهشي',28) 
    insert_answer_data('پیمانکار دارای کارگاه صنعتی،خدماتی،تولیدی و یا فنی و مهندسی ثابت میباشد',28)
    insert_answer_data(' قراردادهاي مورد اجراي دفاتر پيشخوان دولت',28)
    insert_answer_data(' عمليات بيمه گري مورد اجراي نمايندگي و كارگزاري شركت هاي بيمه',28)
    insert_answer_data(' اعطای نمايندگي فروشگاههاي زنجيره اي',28)
    insert_answer_data(' فروش محصولات با نمايندگيهاي مجاز فروش و خدمات پس از فروش',28)
    insert_answer_data('نگهداري كالاو مركبات و غلات در انبارها و سردخانه ها و سيلوهاي مكانيزه ',28)
    insert_answer_data(' پورسانت فروش',28)
    insert_answer_data(' ارائه خدمات توسط هتلها',28)
    
    insert_answer_data('پیمانکار دارای کارگاه صنعتی،خدماتی،تولیدی و یا فنی و مهندسی ثابت میباشد',29)
    insert_answer_data(' تحقيقاتي وپژوهشي',29) 
    insert_answer_data(' مجری قرارداد مشمول نظام حمايتي خاص',29) 
    insert_answer_data('قردادهاي فن آوري اطلاعات و ارتباطات ',29)
    insert_answer_data(' دانش بنیان',29)
    insert_answer_data(' مشاوره مديريت',29)
    insert_answer_data(' قراردادهاي مورد اجراي دفاتر پيشخوان دولت',29)
    insert_answer_data('  قراردادهاي مورد اجراي كارگزاري رسمي تامين اجتماعي',29)
    insert_answer_data(' عمليات بيمه گري مورد اجراي نمايندگي و كارگزاري شركت هاي بيمه',29)
    insert_answer_data(' خدمات فروش بليط توسط نمايندگيهاي شركتهاي حمل ونقل هوايي،ريلي و زميني',29)
    insert_answer_data('حسابرسی',29)
    insert_answer_data('شركت‌هاي تامين سرمايه',29)
    insert_answer_data('شركت‌هاي كارگزاري بورس',29)
    insert_answer_data('شركت‌هاي كارگزاري بورس',29)
    insert_answer_data(' اعطای نمايندگي فروشگاههاي زنجيره اي',29)
    insert_answer_data(' فروش محصولات با نمايندگيهاي مجاز فروش و خدمات پس از فروش',29)
    insert_answer_data('نگهداري كالاو مركبات و غلات در انبارها و سردخانه ها و سيلوهاي مكانيزه ',29)
    insert_answer_data(' پورسانت فروش',29)
    insert_answer_data('   موسسات فرهنگي با موضوع انتشارات و تبليغات در فضاي مجازي',29)
    insert_answer_data(' ارائه خدمات توسط هتلها',29)
    insert_answer_data(' قراردادهاي خريد و فروش  تضميني برق ',29)
    insert_answer_data(' ارائه خدمات مراقبت هاي اوليه بهداشتي و سلامت محور در پايگاههاي سلامت',29)
    insert_answer_data('قراردادهاي غير عمراني مهندسان مشاور',30)
    insert_answer_data('قراردادهاي غير عمراني پیمانکاران',30)
    insert_answer_data('قراردادهاي غير عمراني پیمانکاران با موضوعات خاص',30)
    insert_answer_data('قرارداد دستمزدي',31)
    insert_answer_data('قرارداد با مصالح',31)    
    insert_answer_data('قرارداد ارائه خدمات با استفاده از ماشين‌آلات',31)
    insert_answer_data('قرارداد داراي تجهيزات خريداري شده از خارج از كشور',31)  
    # insert_answer_data(' قراردادهاي غير عمراني مهندسان مشاور',26)
    # insert_answer_data('  قراردادهاي پيمانكاران با موضوع نقشه‌برداري ',26)
    # insert_answer_data('قراردادهاي پیمانکاران و مهندسین مشاور بنیاد مسکن انقلاب اسلامی ',26)
    # insert_answer_data('تامین دکلهای حفاری چاههای نفت و گاز در مناطق خشکی با خدمه مورد نیاز',26)
    # insert_answer_data('قراردادهای غیرعمرانی منعقده به روش   EPC وPC   ',26)
    # insert_answer_data('قراردادهاي خدمات شهری و نگهداری فضای سبز',26)
    # insert_answer_data('تنظیفات ساختمانهای اداری،تجاری،بیمارستانها،مراکزآموزشی ونگهداری تاسیسات',26)    
    # insert_answer_data(' قراردادهای حمل و نقل مواد نفتی',26) 
    # insert_answer_data('قراردادهای حمل و نقل بار و کالای بین شهری ',26)
    # insert_answer_data('قراردادهای جابه‌جایی مسافر بین شهری و درون شهری ',26)
    # insert_answer_data(' قراردادهاي باطله برداری ، استخراج و تحویل مواد معدنی ',26)
    # insert_answer_data(' قراردادهاي بازار یابی و جذب پیامهای بازرگانی',26)
    # insert_answer_data(' قراردادهاي حمل و نقل ریلی',26)
    # insert_answer_data('قراردادهاي اجاره فضا و ارایه خدمات تبلیغاتی  ',26)
    # insert_answer_data(' قراردادهاي خدمات دریایی ',26)
    # insert_answer_data('قراردادهاي خن‌کاری در بنادر  ',26)
    # insert_answer_data(' قراردادهای اجرایی ژئوتکنیک',26)
    # insert_answer_data(' قراردادهای بهره برداری جایگاه سوخت ',26)
    # insert_answer_data(' قرارداد خرید یا فروش(تهیه، تامین و تحویل تجهیزات بدون کار اضافی)',26)
    # insert_answer_data('قرارداد مراکز تعویض پلاک و نقل و انتقال خودرو ',26)
    # insert_answer_data(' اجاره خودرو/ ماشین آلات',26)
    # insert_answer_data(' پیمان مدیریت',26)
    # insert_answer_data('واگذاری بخشهای مختلف بیمارستان ',26)
    # insert_answer_data(' قرارداد دستمزدي',26)
    # insert_answer_data('قرارداد با مصالح ',26)
    # insert_answer_data(' قرارداد ارائه خدمات(با استفاده از ماشين‌آلات)',26)
    # insert_answer_data(' قرارداد داراي تجهيزات خريداري شده از خارج از كشور',26)


    

#--------------------------------------------------------------------------------------    
#results
#بخش عمرانی
    insert_result_data('با توجه به نوع قرارداد اصلی برای ادامه با شروع مجدد تعیین ضریب، گزینه غیرعمرانی را انتخاب نمایید. ',5)
    insert_result_data('در صورت احراز عمرانی بودن قرارداد اصلی و تایید قرارداد فرعی توسط کارفرمای اصلی، به تبعیت از قرارداد اصلی ضریب قرارداد= 14% (حق بیمه= 14%مبلغ قرارداد وبیمه بیکاری=1.6% مبلغ قرارداد میباشد). ولیکن با توجه به پرداخت حق بیمه در قرارداد اصلی تا سقف 15.6% مبلغ قرارداد، حق بیمه ای دریافت نمیگردد و صرفا در صورتیکه حق بیمه لیستهای ارسالی بیش از حق بیمه طبق ضریب باشد یا لیستها خارج از دوره قرارداد ارسال شده باشد، مابه التفاوت آن اخذ میگردد. ',7)
    insert_result_data('در صورت احراز عمرانی بودن قرارداد اصلی و تایید قرارداد فرعی توسط کارفرمای اصلی، به تبعیت از قرارداد اصلی ضریب قرارداد= 6% (حق بیمه= 6%مبلغ قرارداد وبیمه بیکاری=0.6% مبلغ قرارداد میباشد). ولیکن با توجه به پرداخت حق بیمه در قرارداد اصلی تا سقف 6.6% مبلغ قرارداد، حق بیمه ای دریافت نمیگردد و صرفا در صورتیکه حق بیمه لیستهای ارسالی بیش از حق بیمه طبق ضریب باشد یا لیستها خارج از دوره ارسال شده باشد مابه التفاوت آن اخذ میگردد. ',8)
    insert_result_data('با توجه به محل اجرای قرارداد خارج ازمرزهای کشورمشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',9)
    insert_result_data('با توجه به ملیت کارفرما قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',11)
    insert_result_data('با توجه به ملیت مجری قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',13)
    insert_result_data('شخصیت مهندس مشاور نمیتواند حقیقی باشد. برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',17)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود. ',19)
    insert_result_data('ضریب قرارداد : 14% (حق بیمه= 14% مبلغ قراردادوبیمه بیکاری= 1.6 %مبلغ قرارداد مجموعا 15.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای ارسالی قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 15.6% کارکرد مطالبه و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.ضمنا چنانچه هیچگونه لیستی با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه میگردد.ولیکن چنانچه  ليست  " به صورت متمرکز در دفتر مركزي" ارسال شده باشد محاسبه جریمه ليست منتفی است.',22)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود. ',24)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود. ',25)
    insert_result_data('ضریب قرارداد : 6% (حق بیمه= 6% مبلغ قراردادوبیمه بیکاری= 0.6 %مبلغ قرارداد مجموعا 6.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 6.6% کارکرد مطالبه میشود و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.چنانچه هیچگونه لیستی  با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه  و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه  میگردد.',28)
    insert_result_data('ضریب قرارداد : 14% (حق بیمه= 14% مبلغ قراردادوبیمه بیکاری= 1.6 %مبلغ قرارداد مجموعا 15.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای ارسالی قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 15.6% کارکرد مطالبه و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.ضمنا چنانچه هیچگونه لیستی با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه میگردد.ولیکن چنانچه  ليست  " به صورت متمرکز در دفتر مركزي" ارسال شده باشد محاسبه جریمه ليست منتفی است.',29)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',34)
    insert_result_data('ضریب قرارداد : 14% (حق بیمه= 14% مبلغ قراردادوبیمه بیکاری= 1.6 %مبلغ قرارداد مجموعا 15.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای ارسالی قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 15.6% کارکرد مطالبه و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.ضمنا چنانچه هیچگونه لیستی با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه میگردد.ولیکن چنانچه  ليست  " به صورت متمرکز در دفتر مركزي" ارسال شده باشد محاسبه جریمه ليست منتفی است.',35)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',36)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',38)
    insert_result_data('ضریب قرارداد : 14% (حق بیمه= 14% مبلغ قراردادوبیمه بیکاری= 1.6 %مبلغ قرارداد مجموعا 15.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای ارسالی قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 15.6% کارکرد مطالبه و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.ضمنا چنانچه هیچگونه لیستی با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه میگردد.ولیکن چنانچه  ليست  " به صورت متمرکز در دفتر مركزي" ارسال شده باشد محاسبه جریمه ليست منتفی است.',39)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',40)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',41)
    insert_result_data('ضریب قرارداد : 14% (حق بیمه= 14% مبلغ قراردادوبیمه بیکاری= 1.6 %مبلغ قرارداد مجموعا 15.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای ارسالی قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 15.6% کارکرد مطالبه و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.ضمنا چنانچه هیچگونه لیستی با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه میگردد.ولیکن چنانچه  ليست  " به صورت متمرکز در دفتر مركزي" ارسال شده باشد محاسبه جریمه ليست منتفی است.',42)
    insert_result_data('ضریب قرارداد : 6% (حق بیمه= 6% مبلغ قراردادوبیمه بیکاری= 0.6 %مبلغ قرارداد مجموعا 6.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 6.6% کارکرد مطالبه میشود و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.چنانچه هیچگونه لیستی  با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه  و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه  میگردد.',43)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',48)
    insert_result_data('ضریب قرارداد : 6% (حق بیمه= 6% مبلغ قراردادوبیمه بیکاری= 0.6 %مبلغ قرارداد مجموعا 6.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 6.6% کارکرد مطالبه میشود و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.چنانچه هیچگونه لیستی  با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه  و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه  میگردد.',49)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',50)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',52)
    insert_result_data('ضریب قرارداد : 6% (حق بیمه= 6% مبلغ قراردادوبیمه بیکاری= 0.6 %مبلغ قرارداد مجموعا 6.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 6.6% کارکرد مطالبه میشود و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.چنانچه هیچگونه لیستی  با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه  و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه  میگردد.',53)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',54)
    insert_result_data('قرارداد مشمول ضوابط طرحهای عمرانی  نبوده لذا برای ادامه با شروع مجدد تعیین ضریب، ازبخش غیرعمرانی استفاده شود.',55)
    insert_result_data('ضریب قرارداد : 6% (حق بیمه= 6% مبلغ قراردادوبیمه بیکاری= 0.6 %مبلغ قرارداد مجموعا 6.6% مبلغ قرارداد).\n لازم به توضیح است در هنگام محاسبه ابتدا مجموع لیستهای قرارداد اصلی و پیمانکاران فرعی با ضریب قرارداد مقایسه میگردد چنانچه ضریب بیشتر باشد معادل 6.6% کارکرد مطالبه میشود و درصورتیکه لیست بیشتر باشد مبنای محاسبه لیستهای ارسالی میباشد.چنانچه هیچگونه لیستی  با ردیف پیمان ارسال نشده باشد ، مبلغی معادل 10% مجموع حق بیمه  و بیمه بیکاری بعنوان جریمه عدم ارسال لیست محاسبه و مطالبه  میگردد.',56)
#بخش غیرعمرانی



        
    

    
      
     
    

