#version:1.0.0
texts = { 
         'help'                 :       'راهنمای استفادهℹ️',
         'calculate'            :       'تعیین ضریب قرارداد🧮',
         'welcome'              :       ''' سلام.👋
به ربات تعیین ضریب حق بیمه قراردادهای مشمول ماده 38 قانون تامین اجتماعی خوش آمدید.برای شروع از دکمه ها استفاده کنید.🌷
''',
         'help_text'            :       '''
💠با استارت ربات همواره منویی با 5 دکمه کیبوردی با عناوین (راهنمای استفاده، تعیین ضریب قرارداد، تماس با ما، درباره ربات و پشتیبانی و مشاوره) با قابلیت باز و بسته شدن نمایش داده میشود. در صورت بسته شدن کیبورد مذکور،امکان دسترسی به آنرا از طریق < دکمه مربعی با 4 دایره داخل آن > در انتهای سمت راست پایین صفحه خواهید داشت.
💠برای شروع تعیین ضریب قرارداد میبایست منوی «تعیین ضریب قرارداد» را انتخاب نمایید.
در این قسمت نیاز به تکمیل اطلاعاتی ازکارفرما، مجری و قرارداد می‌باشد.
پس از اخذ کلیه اطلاعات مورد نیاز و ثبت نهایی، نتیجه نمایش داده خواهد شد.
پس از نمایش نتیجه دو دکمه شیشه ای برای «شروع مجدد تعیین ضریب» و «خروج» نمایان میشود.
با فشردن دکمه «شروع مجدد تعیین ضریب» ربات دوباره به قسمت اخذ اطلاعات قرارداد هدایت میشود و با فشردن کلید «خروج» ابتدا صفحه ای جهت نظرسنجی و سپس پیام پایانی نمایش داده میشود.
💠چنانچه موضوع قرارداد شما با هیچ کدام از گزینه ها تطابق ندارد و یا در صورت بروز مشکلات دیگر میتوانید با استفاده از منوی «پشتیبانی و مشاوره» به کارشناس/کارشناسان مشاور و یا ادمین ارتباط داده شوید.
در صورت انتخاب منوی «ارسال قرارداد و دریافت مشاوره» میبایست ابتدا کلیه فایلهای مرتبط با قرارداد ارسال و سپس کلید «تایید و ارسال» فشرده شود. 

📌نکته: در تعیین نوع قرارداد منظور از نوع قرارداد عمرانی، قراردادی است که:
1️⃣- بر اساس فهرست بها پایه یا ضوابط تیپ سازمان برنامه و بودجه تنظیم شده باشد.
2️⃣-تمام یا بخشی از بودجه عملیات از محل طرحهای عمرانی دولت تامین شده باشد.
لذا چنانچه قرارداد مورد نظرتان شرایط فوق را ندارد گزینه » غیرعمرانی« را انتخاب نمایید.
البته برخی از قراردادهای منعقده با کارفرمایان مشخص در قوانین صادره، فارغ از محل تامین اعتبار آنها نیز عمرانی میباشند که برای تعیین ضریب آنها میبایست با انتخاب گزینه عمرانی ادامه مراحل انجام گردد. 
        ''',
         'back'                 :       ' بازگشت به مرحله قبل ⬅️',
         'contact_us'           :       'تماس با ما📞', 
         'About'                :       'درباره ربات🤖',
         'support'              :       'پشتیبانی و مشاوره🧑‍💻',
         'consultant_link'      :       'https://t.me/F_mrzk',
         'contact_txt'          :       '''
آدرس دفتر: 
تهران،خیابان آزادی
آدرس ایمیل:
fmirzaeik@yahoo.com
راه ارتباطی در تلگرام:
@F_mrzk
         ''',
         'result_menu'          :       'تکمیل اطلاعات مورد نیاز و آماده نمایش نتیجه',
         'end'                  :       'سپاس از حمایت و همراهیتان🌿🌹🌿.لطفا با ثبت میزان رضایت خود،ما را در بهبود عملکرد ربات یاری فرمایید.',
         'thanks'               :       'باتشکر!🙏نظر شما با موفقیت ثبت شد.🌷',
         'about_txt'            :         '''
نام: ربات محاسبه گر ضریب حق بیمه قراردادها
طراحی این ربات بر اساس آخرین بخشنامه ها و آیین نامه های سازمان تامین اجتماعی و توسط یکی از کارشناسان باتجربه و متخصص امور پیمان صورت پذیرفته است.''',
         }