texts = { 
         'help'                 :       'راهنمای استفادهℹ️',
         'calculate'            :       'تعیین ضریب قرارداد🧮',
         'welcome'              :       ''' سلام.👋
به ربات تعیین ضریب حق بیمه قراردادهای مشمول ماده 38 قانون تامین اجتماعی خوش آمدید.🌷
''',
         'help_text'            :       '''
         💠برای شروع تعیین ضریب قرارداد منوی «تعیین ضریب قرارداد» را انتخاب نمایید.
در این قسمت نیاز به تکمیل اطلاعاتی ازکارفرما، مجری و قرارداد می‌باشد.
پس از اخذ کلیه اطلاعات مورد نیاز و ثبت نهایی، نتیجه نمایش داده خواهد شد.
چنانچه موضوع قرارداد شما با هیچ کدام از گزینه ها تطابق ندارد و یا در صورت بروز مشکلات دیگر میتوانید از طریق منوی «پشتیبانی» به کارشناس مربوطه وصل شوید.

📌نکته: در تعیین نوع قرارداد منظور از نوع قرارداد عمرانی قراردادی است که:
1️⃣- بر اساس فهرست بها پایه یا ضوابط تیپ سازمان برنامه و بودجه تنظیم شده باشد.
2️⃣-تمام یا بخشی از بودجه عملیات از محل طرحهای عمرانی دولت تامین شده باشد.
لذا چنانچه قرارداد مورد نظرتان شرایط فوق را ندارد گزینه » غیرعمرانی« را انتخاب نمایید.
البته برخی از قراردادهای منعقده با کارفرمایان مشخص در قوانین صادره، فارغ از محل تامین اعتبار آنها نیز عمرانی میباشند که برای تعیین ضریب آنها میبایست با انتخاب گزینه عمرانی ادامه مراحل انجام گردد.
        ''',
         'back'                 :       ' بازگشت به مرحله قبل ⬅️',
         'contact_us'           :       'تماس با ما📞', 
         'About'                :       'درباره ربات🤖',
         'support'           :       'پشتیبانی و مشاوره🧑‍💻',
         'consultant_link'      :       'https://t.me/F_mrzk',
         'support_link'          :      'ارتباط با [پشتیبانی](tg://user?id={SUPPORT_CID})',
         'contact_txt'         :       '''
آدرس: تهران،خیابان آزادی،سازمان تامین اجتماعی
شماره تلفن ثابت ☎️
02164501
02164502376
شماره همراه 📱
09128305876                 
         ''',
         'about_txt'            :         '''
نام: ربات محاسبه گر ضریب قراردادها
طراحی این ربات بر اساس آخرین بخشنامه ها و آیین نامه های سازمان تامین اجتماعی و توسط یکی از کارشناسان متخصص امور پیمان صورت پذیرفته است.''',
         }